/* 
  Localizable.strings
  ObjectiveC_Extension

  Created by Vitor Marques de Miranda on 29/09/17.
  Copyright © 2017 VitorMM. All rights reserved.
*/

// Misc
"OK" = "OK";
"Cancel" = "Abbrechen";
"Yes" = "Ja";
"No" = "Nein";

// NSAlert Extension
"Success" = "Erfolg";
"Warning" = "Warnung";
"Error" = "Fehler";

// NSData Extension
//"Error while reading file data: %@" = "Erro enquanto lia dados de arquivo: %@";

// NSString Extension
"Error while reading file: %@" = "Fehler beim lesen der Datei: %@";
"Error while writting file: %@" = "Fehler beim schreiben der Datei: %@";

// NSFileManager Extension
"Error while creating symbolic link: %@" = "Erro enquanto criava link simbólico: %@";
"Error while creating folder: %@" = "Fehler beim erstellen des Ordners: %@";
"Error while moving file: %@" = "Fehler beim bewegen der Datei: %@";
"Error while copying file: %@" = "Fehler beim kopieren der Datei: %@";
"Error while removing file: %@" = "Fehler beim entfernen der Datei: %@";
"Error while listing folder contents: %@" = "Fehler beim auflisten des Ordnerinhaltes von: %@";
//"Error while listing folder contents: %@ doesn't exist." = "Erro enquanto listava o conteúdo de pasta: %@ não existe.";
//"Error while listing folder contents: %@ is not a folder." = "Erro enquanto listava o conteúdo de pasta: %@ não é uma pasta.";
//"Error while retrieving symbolic link destination: %@" = "Erro enquanto obtia destino de link simbólico: %@";

// NSTask Extension
//"Path for %@ not found." = "Caminho para %@ não encontrado.";
//"File %@ not found." = "Arquivo %@ não encontrado.";
//"File %@ not runnable." = "Arquivo %@ não é executável.";
//"Directory %@ does not exists." = "Diretório %@ não existe.";

